Examples/Lagrangian/LanguageIntegration/angledDuctWithPython2Inject/0.org/alphat.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

<!--(if foamFork=="extend")-->
wallType alphatWallFunction;
<!--(else)-->
wallType compressible::alphatWallFunction;
<!--(end)-->

boundaryField
{
    front
    {
        type            $wallType;
        Prt             0.85;
        value           uniform 0;
    }
    back
    {
        type            $wallType;
        Prt             0.85;
        value           uniform 0;
    }
    wall
    {
        type            $wallType;
        Prt             0.85;
        value           uniform 0;
    }
    porosityWall
    {
        type            $wallType;
        Prt             0.85;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
